#include "stm8s.h"
#include "uart_sdcc.h"
#include "common.sdcc.h"

/*
 * 延时
 */
void delay(unsigned int n)
{
    while (n--);
}

/*波特率=fmaster/UART_DIV，BRR2的高四位+BRR1+BRR2的第四位组成了UART_DIV*/
void uart_init()//115200@16Mhz，因为8266默认的波特率就是115200
{
    UART2->CR1=0x00;//1个起始位，8个数据位，无校验位
    UART2->CR2=0x2c;//接收中断使能，使能发送、接收
    UART2->CR3=0x00;//1个停止位
    //设置波特率近似115200
    UART2->BRR2=0x0B;
    UART2->BRR1=0x08;
}

/*******************************************************************************
 ****函数功能:UART2发送8位数据函数
 ****入口参数:
 ****出口参数:
 ****函数备注:
 *******************************************************************************/
void uart_send_byte(unsigned char Data)
{
    while((UART2->SR&0x80)==0);
    UART2->DR = Data;
}

/*******************************************************************************
 ****函数名称:
 ****函数功能:发送Hex数据
 ****版本:V1.0
 ****日期:14-2-2014
 ****入口参数:dat-需要发送的数据
 ****出口参数:无
 ****说明:
 ********************************************************************************/
void uart_send_hex(unsigned char dat)
{
    uart_send_byte('0');
    uart_send_byte('x');
    uart_send_byte(hex_array[dat >> 4]);
    uart_send_byte(hex_array[dat & 0x0F]);
    uart_send_byte(' ');
}

/*******************************************************************************
 ****函数名称:
 ****函数功能:发送字符串
 ****版本:V1.0
 ****日期:14-2-2014
 ****入口参数:dat-需要发送的数据
 ****出口参数:无
 ****说明:
 ********************************************************************************/
void uart_send_string(unsigned char *dat)
{
    while (*dat != '\0')
    {
        uart_send_byte(*dat);
        dat++;
    }
}

/*******************************************************************************
 ****函数功能:UART2接收数据函数
 ****入口参数:
 ****出口参数:
 ****函数备注:
 *******************************************************************************/
unsigned char uart_recv_byte(void)
{
    while((UART2->SR&0x20)==0);
    return ((unsigned char)UART2->DR);
}

